# Brewfile.dev - Development tools
# Usage: brew bundle --file=Brewfile.dev

# Taps
tap "jesseduffield/lazygit"
tap "jesseduffield/lazydocker"

# Terminal emulators
cask "kitty"
cask "alacritty"
cask "ghostty"

# Terminal multiplexer
brew "tmux"
brew "reattach-to-user-namespace"
brew "mosh"

# Shell prompt
brew "starship"
brew "oh-my-posh"

# Editors
brew "neovim"
brew "neovim-remote"            # Open files in existing nvim instance

# Git tools
brew "git-extras"
brew "git-flow"
brew "git-secrets"
brew "git-delta"
brew "git-filter-repo"
brew "difftastic"
brew "tig"
brew "pre-commit"
brew "bfg"
brew "hub"
brew "gh"                       # GitHub CLI
brew "jesseduffield/lazygit/lazygit"

# Git GUI
cask "gitbutler"
cask "sourcetree"
cask "meld"                     # Diff tool

# File management
brew "ranger"
brew "ncdu"

# HTTP tools
brew "httpie"
brew "xh"

# Languages and runtimes
brew "mise"                     # Runtime version manager (replaces asdf, nvm, pyenv)
brew "python"
brew "pipenv"
brew "pipx"
brew "go"
brew "ruby"
brew "rustup"
brew "lua"
brew "luajit"
brew "luarocks"
brew "lua-language-server"
brew "stylua"                   # Lua formatter
brew "shellcheck"
brew "ccls"                     # C/C++ language server

# Container tools
brew "jesseduffield/lazydocker/lazydocker"
cask "podman-desktop"
cask "docker"

# Kubernetes
brew "kubernetes-cli"
brew "helm"
brew "kustomize"
brew "kubectx"
brew "k9s"

# Network tools
brew "nmap"
brew "mitmproxy"            # HTTP/HTTPS proxy for debugging
cask "proxyman"             # Native macOS HTTP debugging proxy
cask "wireshark"            # Network protocol analyzer

# Image/Media tools
brew "imagemagick"
brew "exiftool"
brew "ffmpeg"

# Code editors
cask "visual-studio-code"

# API tools
cask "postman"

# Database
brew "redis"
cask "dbeaver-community"

# Design
cask "figma"

# Documentation
cask "dash"                     # Offline documentation browser

# Diagram tools
brew "d2"                       # Modern diagram scripting language

# Misc dev tools
brew "autoconf"
brew "pandoc"
brew "prettyping"
brew "rich-cli"                 # Rich text CLI output
brew "watchexec"
